GetConversionAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetConversionAmount>
            <!--Optional:-->
            <tem:CurrencyFrom></tem:CurrencyFrom>
            <!--Optional:-->
            <tem:CurrencyTo></tem:CurrencyTo>
            <tem:RateDate></tem:RateDate>
            <tem:Amount></tem:Amount>
        </tem:GetConversionAmount>
    </soapenv:Body>
</soapenv:Envelope>